{
  "basics": {
    "name": "Richard Roncancio",
    "label": "Systems engineer",
    "picture": "",
    "email": "richard.batusai@gmail.com",
    "phone": "(+49) 01525-6841771",
    "website": "https://www.linkedin.com/in/richard-roncancio-6034b651/",
    "summary": "A professional software engineer with 12+ years of experience in web development (mostly frontend) building applications and solving hard problems based on client and end users requirements with a deep knowledge in html, css, javascript and components based frameworks like React. I enjoy learning, sharing knowledge and working in exciting new challenges.",
    "location": {
      "address": "Reichenberger Str. 153",
      "postalCode": "10999",
      "city": "Berlin",
      "countryCode": "DE",
      "region": "Berlin"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "batusai513",
        "url": "https://github.com/batusai513"
      },
      {
        "network": "Twitter",
        "username": "Sr_Batusai",
        "url": "https://twitter.com/Sr_Batusai"
      },
      {
        "network": "LinkedIn",
        "username": "richard-roncancio",
        "url": "https://www.linkedin.com/in/richard-roncancio-6034b651/"
      }
    ]
  },
  "work": [
    {
      "name": "Auto1",
      "position": "Sr. Front end Developer",
      "website": "https://www.auto1.com/en/home",
      "location": "Berlin",
      "startDate": "2018-10-15",
      "summary": "Among my responsabilities I have to work on new features for all the applications in the http://wirkaufendeinauto.de spectrum and the internal tools, analyze and optimize the performance and load times and general bug fixing.",
      "highlights": [
        "Lead the slim funnels initiative to migrate our old framework and tools to build form funnels for A/B experiments to a more flexible codebase. This new codebase resulted in a decrease of the development time invested in creating new experiments and funnels and a reduction of about 60% smaller bundle size of the generated pages",
        "Lead the migration of our newer codebases (2 monorepos and about 30 packages) from vanilla Javascript to Typescript, resulting in having up to date code, less runtime errors, code editor autocomplete and overall a much better developer experience",
        "Migrated one of our more complicated codebases and logic used by our main user facing forms to a finite state machine (statechart), this process involved analysing the previous implementation and logic, design and implement the machine using Xstate, build components (form, fields, etc) backed by this new machine. This end up in a more flexible form that allows to add/remove fields in a more simple way",
        "General maintanance of our codebases, updating runtimes and external packages to be up to date, optimisations of our bundler (webpack) configurations to make our JS and CSS bundles as smaller as they can be",
        "Designed and built our design system based on React components and SASS stylesheets using BEM naming convention, and PostCSS configurations with PurgeCSS on the application side to remove unused CSS, this resulted in about 60% smaller css bundles",
        "Designed and built CLI tools to increase the developer experience and efficiency by automating several repeating tasks",
        "Helped built the new user account dashboard, a completely new React and GraphQL application with localization and internationalization.",
        "Implemented user authentication and authorization using JWT access and refresh tokens",
        "Analize the current application and SEO pages and look for opportunities to optimize performance, load times and and time to interactive leading to several tweaks to the webpack that shrinked the bundle sizes by almost 50%, removed unused JS and css and implementing responsive images strategies."
      ]
    },
    {
      "name": "Koombea",
      "position": "Sr. Front end Developer",
      "website": "https://www.koombea.com",
      "location": "Barranquilla",
      "startDate": "2014-06-15",
      "endDate": "2018-10-01",
      "summary": "My responsibilities are the development of functional user interfaces, integrations with Ruby on Rails using erb and haml, Research and implementation of new technologies for our front end department, training of new front end hires and building full featured client side applications meeting user requirements in creative, efficient, intuitive and aesthetically pleasing ways.",
      "highlights": [
        "Built our first Mobile Application using React Native",
        "Created a simpler reusable and scalable boilerplate in SCSS by implementing SMACSS method and BEM naming convention; this later became the company's default standard.",
        "Acted as Front-end Lead for several client side applications base on frameworks such as React.js. and AngularJS.",
        "Introduced several new technologies and frameworks to our front end stack including SASS, Backbone.js, emberjs, angularjs, Reactjs, vuejs and new tooling such as Babel js and among others.",
        "Helped to evaluate and train several new hires for the front end department."
      ]
    },
    {
      "name": "Koombea",
      "position": "Jr. Front end Developer",
      "website": "https://www.koombea.com",
      "location": "Barranquilla",
      "startDate": "2012-01-15",
      "endDate": "2014-06-15",
      "summary": "Started as a junior developer my personal goal was to learn as much as possible and apply that knowledge to build functional websites and to create user interfaces for applications.",
      "highlights": [
        "Built several Marketing sites in HTML, CSS and Javsript (JQuery).",
        "Created websites using Wordpress CMS.",
        "Integrated HTML markup to Ruby on Rails Applications using erb and haml.",
        "Created our first responsive site using the latest techniques at the time",
        "Created the baselines for building responsive websites.",
        "Actively researched new tools to integrate into the Front end stack and workflow."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "BarranquillaJS",
      "position": "Founder",
      "website": "https://www.meetup.com/es-ES/BarranquillaJS/",
      "startDate": "2015-03-04",
      "endDate": "2018",
      "summary": "Barranquilla's first javascript community for people wanting to learn and share about javascript",
      "highlights": ["founder and speaker"]
    }
  ],
  "education": [
    {
      "institution": "Universidad Autonoma del Caribe",
      "area": "Computer Science Engineering",
      "studyType": "",
      "startDate": "2011-06-15",
      "endDate": "2016-06-30",
      "gpa": "",
      "courses": []
    },
    {
      "institution": "Kyle Simpson",
      "area": "Javascript Training",
      "studyType": "",
      "startDate": "2015",
      "endDate": "2016",
      "gpa": "",
      "courses": [
        "Rethinking Async, Functional JS and Node Fundamentals",
        "Advanced JavaScript"
      ]
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Frontend",
      "level": "Advanced",
      "keywords": [
        "Javascript",
        "Typescript",
        "Browser APIs",
        "React",
        "NextJS",
        "Remix",
        "redux",
        "React Native",
        "Vue.js",
        "Webpack",
        "Vite",
        "Babel",
        "Apolo",
        "Functional Programming",
        "HTML",
        "CSS",
        "BEM",
        "PostCSS",
        "SASS",
        "Tailwind",
        "CSS Architecure",
        "GraphQL",
        "Prisma",
        "Git"
      ]
    },
    {
      "keywords": ["Node", "Postgres"],
      "level": "Intermediate",
      "name": "Backend"
    },
    {
      "keywords": ["JenkinsCI", "Docker", "Groovy", "Rust"],
      "level": "Knowledge",
      "name": "Others"
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Advanced"
    },
    {
      "language": "Spanish",
      "fluency": "Native Speaker"
    }
  ],
  "interests": [
    {
      "name": "Movies",
      "keywords": []
    },
    {
      "name": "VideoGames",
      "keywords": []
    },
    {
      "name": "Sports",
      "keywords": []
    }
  ],
  "references": []
}
